In [7]:
import pandas as pd

data = pd.DataFrame({
    'name': ['John', 'Anna', 'Peter', 'Linda'],
    'age': [23, 36, 32, 28],
    'city': ['New York', 'Paris', 'Berlin', 'London'],
    'job': ['student', 'teacher', 'developer', 'nurse']
})

data

    name  age      city        job
0   John   23  New York    student
1   Anna   36     Paris    teacher
2  Peter   32    Berlin  developer
3  Linda   28    London      nurse

In [ ]:
import pandas as pd

pd.merge(left, right, how='inner', on=None, left_on=None, right_on=None, left_index=False, right_index=False, sort=False)

# left Object DataFrame
# right Object DataFrame yang lain
# on Kolom yg akan digabung. Harus ditemukan di objek DataFrame kiri dan kanan. 
# how Diisi dengan salah satu dari : 'left', 'right', 'outer', 'inner'. Defaults : ‘inner’. 
# sort Mengurutkan ‘join keys’ berdasarkan alphabet. Defaults = False

In [14]:
import pandas as pd

kiri = pd.DataFrame({
    'Id': [1,2,3],
    'Nama': ['Anton', 'Budi', 'Cici'],
    'Alamat': ['Jakarta', 'Bandung', 'Surabaya']
})

kanan = pd.DataFrame({
    'Id': [2,3,1],
    'Nama': ['Doni', 'Euis', 'Fafa'],
    'Alamat': ['Bogor', 'Garut', 'Cirebon']
})

gabung = pd.merge(kiri, kanan, on='Id')
gabung

   Id Nama_x  Alamat_x Nama_y Alamat_y
0   1  Anton   Jakarta   Fafa  Cirebon
1   2   Budi   Bandung   Doni    Bogor
2   3   Cici  Surabaya   Euis    Garut

In [18]:
import pandas as pd

# pandas.DataFrame(data, index, columns, dtype, copy)

data = [['Anton', 23], ['Budi', 25], ['Cici', 22]]
df = pd.DataFrame(data, columns=['Nama', 'Usia'], index=['a', 'b', 'c'])
df

    Nama  Usia
a  Anton    23
b   Budi    25
c   Cici    22